# 01. Import Libraries / Path / Data

In [88]:
# import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [90]:
# create path
path = r'C:\Users\TypicalPancake\DA Instacart Basket Analysis 12-2024'

In [92]:
# create dataframe
cs = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_grouped.pkl'))

In [93]:
# previewing
cs.shape

(206209, 10)

In [94]:
cs.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# 02. Wrangle Data

In [157]:
# renaming columns for clarity
cs = cs.rename(columns={
        'user id' : 'user_id',
        'first name' : 'first_name',
        'last name' : 'last_name',
        'STATE' : 'state',
        'date joined' : 'date_joined',
        'number dependants' : 'number_dependants',
        'family status' : 'family_status'})

In [159]:
# previewing
cs.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [161]:
# previewing
cs.describe

<bound method NDFrame.describe of         user_id first_name last_name  gender           state  age date_joined  \
0         26711    Deborah  Esquivel  Female        Missouri   48    1/1/2017
1         33890   Patricia      Hart  Female      New Mexico   36    1/1/2017
2         65803    Kenneth    Farley    Male           Idaho   35    1/1/2017
3        125935   Michelle     Hicks  Female            Iowa   40    1/1/2017
4        130797        Ann   Gilmore  Female        Maryland   26    1/1/2017
...         ...        ...       ...     ...             ...  ...         ...
206204   168073       Lisa      Case  Female  North Carolina   44    4/1/2020
206205    49635     Jeremy   Robbins    Male          Hawaii   62    4/1/2020
206206   135902      Doris  Richmond  Female        Missouri   66    4/1/2020
206207    81095       Rose   Rollins  Female      California   27    4/1/2020
206208    80148    Cynthia     Noble  Female        New York   55    4/1/2020

        number_dependants family_status  income
0                       3       married  165665
1                       0        single   59285
2                       2       married   99568
3                       0        single   42049
4                       1       married   40374
...                   ...           ...     ...
206204                  1       married  148828
206205                  3       married  168639
206206                  2       married   53374
206207                  1       married   99799
206208                  1       married   57095

[206209 rows x 10 columns]>

In [163]:
# checking for missing values
missing_values = cs.isnull().sum()

In [165]:
# previewing
missing_values

user_id                  0
first_name           11259
last_name                0
gender                   0
state                    0
age                      0
date_joined              0
number_dependants        0
family_status            0
income                   0
dtype: int64

In [167]:
# checking for duplicates
duplicates = cs.duplicated()

In [169]:
# preview
duplicates

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

In [171]:
# finding sum of duplicates
n_duplicates = duplicates.sum()

In [173]:
# previewing
n_duplicates

0

In [175]:
# checking column types
cs.dtypes

user_id               int64
first_name           object
last_name            object
gender               object
state                object
age                   int64
date_joined          object
number_dependants     int64
family_status        object
income                int64
dtype: object

# 03. Combining Data

In [184]:
# merging dataframes
merged_cs = pd.merge(ords_prods_merge, cs, on='user_id', how='inner')

In [188]:
# previewing
merged_cs.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge,...,order_frequency_flag,first_name,last_name,gender,state,age,date_joined,number_dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2539329,1,1,2,8,NaN,14084,2,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,2539329,1,1,2,8,NaN,12427,3,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2539329,1,1,2,8,NaN,26088,4,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,2539329,1,1,2,8,NaN,26405,5,0,both,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [190]:
merged_cs.shape

(32404859, 33)

In [194]:
# export
merged_cs.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))